内存：1栈内存（地址），2堆内存（属性，变量数据），3全局区（static变量，全局变量）  4 代码区

1   overloaded 重载  一个类中 方法名相同，参数类型参数个数 不同；
2   override 覆写  继承关系中 子类重写一个 和父类一样的方法，方法名， 参数类型，参数个数，返回值类型都相同；   
	主要子类完善父类的方法，提供更多父类方法实现不了的功能；
	覆写的权限：子类覆写的权限不能比父类的方法权限 严格；

3 对象的多态性： 继承关系中，子类与父类的转换，
	向上转型（自动完成）：父类 父类对象 = 子类实例；
	向下转型（强制转型）：子类 子类对象 = （子类）父类实例；
	！！！向上转型为了统一参数类型。向下转型之前一定要 先向上转型；建立关系之后才能向下转型；
		多态存在的三个必要条件
		一、要有继承；
		二、要有重写；
		三、父类引用指向子类对象。
4   	抽象类由于存在一些属性，抽象类一定存在构造方法，实例化的时候先执行父类构造，在调用子类构造；
	抽象类必须有子类，final定义的类不能有子类；

5  接口： 声明interface，实现 implements .   构成  抽象方法，全局常量；	

6 匿名内部类，子类继承父类或接口， 可以不在定义子类，直接在调用出处写 内部类 重写 父类或接口方法， 节省文件。

7字符串和基本数据类型互相转换：   字符串与基本数据类型转换 依靠包装类     基础数据类型 temp = 基础数据封装类.parse***（字符串变量str)方法实现
			       基本数据类型变为字符串 依靠    String str = String.valueaOf(数据类型变量)    方法完成

8多线程       继承Thread类           实现Runnable 接口           start()方法
